#### `terraform plan` Success

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.ticketmasterprimary.aws_ecs_service.mock-service will be created
+ resource "aws_ecs_service" "mock-service" {
      + cluster                            = "arn:aws:ecs:us-west-2:728489771660:cluster/mocks"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + iam_role                           = "arn:aws:iam::728489771660:role/tf_example_ecs_role"
      + id                                 = (known after apply)
      + launch_type                        = "EC2"
      + name                               = "ticketmasterprimary"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + task_definition                    = (known after apply)

      + load_balancer {
          + container_name   = "ticketmasterprimary"
          + container_port   = 8080
          + target_group_arn = (known after apply)
        }

      + placement_strategy {
          + field = (known after apply)
          + type  = (known after apply)
        }
    }

  # module.ticketmasterprimary.aws_ecs_task_definition.service-task-definition will be created
+ resource "aws_ecs_task_definition" "service-task-definition" {
      + arn                   = (known after apply)
      + container_definitions = jsonencode(
            [
              + {
                  + cpu          = 10
                  + essential    = true
                  + image        = "quay.io/gametime/ticketmasterprimary:latest"
                  + memory       = 512
                  + name         = "ticketmasterprimary"
                  + portMappings = [
                      + {
                          + containerPort = 8080
                          + hostPort      = 0
                        },
                    ]
                },
            ]
        )
      + family                = "ticketmasterprimary"
      + id                    = (known after apply)
      + network_mode          = (known after apply)
      + revision              = (known after apply)
    }

  # module.ticketmasterprimary.aws_lb_listener_rule.service-listener will be created
+ resource "aws_lb_listener_rule" "service-listener" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = "arn:aws:elasticloadbalancing:us-west-2:728489771660:listener/app/mocks/c197d4e5555de1e5/6282c8b4f28f0665"
      + priority     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + field  = "host-header"
          + values = [
              + "ticketmasterprimary-mock.testing.gteng.co",
            ]
        }
    }

  # module.ticketmasterprimary.aws_lb_target_group.service-target-group will be created
+ resource "aws_lb_target_group" "service-target-group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + deregistration_delay               = 300
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + name                               = "ticketmasterprimary"
      + port                               = 8080
      + protocol                           = "HTTP"
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + target_type                        = "instance"
      + vpc_id                             = "vpc-761ad012"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "302"
          + path                = "/__admin"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # module.ticketmasterprimary.aws_route53_record.service-record will be created
+ resource "aws_route53_record" "service-record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "ticketmasterprimary-mock.testing.gteng.co"
      + records         = [
          + "mocks-493779253.us-west-2.elb.amazonaws.com",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z27O3R35PB79OH"
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform-ticketmasterprimary`, Action: `hashicorpterraform-github-actions4`*